---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeSettings.DoesConduitStandardTypeExist(System.String)
source: html/3ef858e5-0984-0d1d-c063-2ff07feed167.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettings.DoesConduitStandardTypeExist Method

Checks if the specified conduit standard exist.

## Syntax (C#)
```csharp
public bool DoesConduitStandardTypeExist(
	string standardName
)
```

## Parameters
- **standardName** (`System.String`) - The conduit standard name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null